In [2]:
import pandas as pd

# Sample dataset: create a simple table with missing values
data = {
    'Name': ['Dashami', 'Govind', 'Charlie', 'nikhil', None],
    'Age': [25, 30, None, 22, 29],
    'City': ['New York', None, 'Los Angeles', 'Chicago', 'Miami']
}

df = pd.DataFrame(data)
df

      Name   Age         City
0  Dashami  25.0     New York
1   Govind  30.0         None
2  Charlie   NaN  Los Angeles
3   nikhil  22.0      Chicago
4     None  29.0        Miami